# Определяет базовый образ
FROM node
# Объявляет автора (рекомендуется включать данную строку)
LABEL maintainer suzem-tamog@yandex.ru
# Клонирует код репозитория
RUN git clone -q https://github.com/docker-in-practice/todo.git
# Перемещает в новый клонированный каталог
WORKDIR todo
# Запускает команду установки менеджера пакетов (npm)
# Вывод нас не интересует, поэтому перенаправляем его в /dev/null
RUN npm install >/dev/null
# Указывает, какой порт должно прослушивать приложение
EXPOSE 8000
# Сообщает, какая команда будет выполнена при запуске контейнера
CMD ["npm", "start"]
